# GetMaterialTexture

```pascal
FUNCTION GetMaterialTexture(objectHandle : HANDLE): LONGINT;
```

```python
def vs.GetMaterialTexture(objectHandle):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes